studies/KarmanVortexStreetLaminar/case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    cylindre.stl 
    {
        type triSurfaceMesh;
        name cylinder; 
    }
    

    // simple "interest area" without importance on the meshing
    refinementBox
    {
        type box;
        min (-0.5 -0.5 -0.1); 
        max (4 0.5 0.1); 
    }
};

castellatedMeshControls
{
    maxLocalCells 800000;
    maxGlobalCells 1000000;
    minRefinementCells 10;
    
    // smoothness through the levels of refinement 
    nCellsBetweenLevels 7; 

    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces true;

    features ( { file "cylindre.eMesh"; level 2; } ); 

    refinementSurfaces
    {
        cylinder 
        { 
            level (4 5); // level 4 for the bulk, level 5 for the boundary layer
        } 
    }

    refinementRegions
    {
        // distance based refinement around the cylinder
        cylinder
        {
            mode distance;
            levels
            (
                (0.05 5)  // Très fin (niveau 5) juste autour du cylindre
                (0.2  4)  // Niveau 4 pour capturer le décollement
                (0.5  3)  // Niveau 3 pour le sillage proche
                (1.5  2)  // Niveau 2 pour le sillage lointain
            );
            mode distance;
            levels (
                (0.1 4)  // large
                (0.2 3)   
                (0.5 2)  // boundary layer
                (1 1)  // near wake
            );
        }

        refinementBox
        {
            mode inside;
            levels ((1.0 1));
        }
    }

    locationInMesh (-0.2 0.2 0.025); 
}

// control of the snapping process (moving the points to the geometry)
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0; 
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}

// boundary layer meshing parameters
addLayersControls
{
    relativeSizes       true;
    layers
    {
        "cylinder.*"
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio      1.2;    
    finalLayerThickness 0.5;    
    minThickness        0.05;   
    
    // stability parameters
    nLayerIter          15; 
    nRelaxIter          5;      
    nSmoothSurfaceNormals 1;    
    nSmoothNormals      3;      
    nSmoothThickness    10; 
    nGrow                0;
    minMedialAxisAngle 90;
    maxThicknessToMedialRatio 5;
    nBufferCellsNoExtrude 0;
    
    maxFaceThicknessRatio 0.5;  
    featureAngle        60;     
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea 1e-13;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist 0.02;
    nSmoothScale 4;
    errorReduction 0.75;
    planarity 1e-4;
}

mergeTolerance 1e-6;