studies/KarmanVortexStreetLaminar/case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

// initial conditions
internalField   uniform 0;

// Boundary conditions
boundaryField
{
    inlet
    {
        type            zeroGradient; // Free inflow condition, no gradient of velocity at the inlet
    }
    outlet
    {
        type            fixedValue; // Set the pressure to zero at the outlet to allow flow to exit the domain
        value           uniform 0; 
    }
    walls
    {
        type            zeroGradient; // allow the pressure to adjust based on the flow conditions at the walls
    }
    cylinder
    {
        type            zeroGradient; // no pressure variation across the cylinder surface
    }
    front
    {
        type            symmetryPlane; 
    }
    back
    {
        type            symmetryPlane; 
    }
}