studies/KarmanVortexStreetLaminar/case/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

// solver definition for pressure and velocity fields
solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

// PISO (Pressure Implicit with Splitting of Operators) parameters for transient simulations
/*
PISO { 
    nCorrectors 2; 
    nNonOrthogonalCorrectors 1; 
    pRefCell 0; 
    pRefValue 0; 
    }
*/

// PIMPLE (merged PISO-SIMPLE) parameters for transient simulations with larger time steps
PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 1;
    pRefCell 0;
    pRefValue 0;
}