studies/KarmanVortexStreetLaminar/case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Surface feature extraction settings for the STL geometry
cylindre.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150; // angle in degrees to determine if an edge is a feature (sharp edge)
    writeObj            yes; // write the extracted features in OBJ format for visualization
}